[v@sap-terraform-es-poc TERRAFORM]$ terraform apply
2020/07/07 10:58:37 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2020/07/07 10:58:37 [INFO] Terraform version: 0.12.28
2020/07/07 10:58:37 [INFO] Go runtime version: go1.12.13
2020/07/07 10:58:37 [INFO] CLI args: []string{"/usr/local/bin/terraform", "apply"}
2020/07/07 10:58:37 [DEBUG] Attempting to open CLI config file: /home/v/.terraformrc
2020/07/07 10:58:37 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2020/07/07 10:58:37 [DEBUG] checking for credentials in "/home/v/.terraform.d/plugins"
2020/07/07 10:58:37 [INFO] CLI command args: []string{"apply"}
2020/07/07 10:58:37 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2020/07/07 10:58:37 [DEBUG] New state was assigned lineage "e18552e4-6c4b-edd1-7320-f7e3294feb42"
2020/07/07 10:58:37 [DEBUG] checking for provider in "."
2020/07/07 10:58:37 [DEBUG] checking for provider in "/usr/local/bin"
2020/07/07 10:58:37 [DEBUG] checking for provider in ".terraform/plugins/linux_amd64"
2020/07/07 10:58:37 [ERROR] ignoring non-file /opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm-master
2020/07/07 10:58:37 [DEBUG] found provider "terraform-provider-ibm_v1.7.1"
2020/07/07 10:58:37 [DEBUG] checking for provider in "/home/v/.terraform.d/plugins"
2020/07/07 10:58:37 [DEBUG] found valid plugin: "ibm", "1.7.1", "/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1"
2020/07/07 10:58:37 [DEBUG] checking for provisioner in "."
2020/07/07 10:58:37 [DEBUG] checking for provisioner in "/usr/local/bin"
2020/07/07 10:58:37 [DEBUG] checking for provisioner in ".terraform/plugins/linux_amd64"
2020/07/07 10:58:37 [DEBUG] checking for provisioner in "/home/v/.terraform.d/plugins"
2020/07/07 10:58:37 [INFO] backend/local: starting Apply operation
2020-07-07T10:58:38.163-0500 [INFO]  plugin: configuring client automatic mTLS
2020-07-07T10:58:38.201-0500 [DEBUG] plugin: starting plugin: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 args=[/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1]
2020-07-07T10:58:38.202-0500 [DEBUG] plugin: plugin started: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 pid=26358
2020-07-07T10:58:38.202-0500 [DEBUG] plugin: waiting for RPC address: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1
2020-07-07T10:58:38.272-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:38 IBM Cloud Provider version 1.7.1
2020-07-07T10:58:38.276-0500 [INFO]  plugin.terraform-provider-ibm_v1.7.1: configuring server automatic mTLS: timestamp=2020-07-07T10:58:38.276-0500
2020-07-07T10:58:38.311-0500 [DEBUG] plugin: using plugin: version=5
2020-07-07T10:58:38.312-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: plugin address: network=unix address=/tmp/plugin137563257 timestamp=2020-07-07T10:58:38.311-0500
2020-07-07T10:58:38.387-0500 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unimplemented desc = unknown service plugin.GRPCStdio"
2020-07-07T10:58:38.410-0500 [DEBUG] plugin: plugin process exited: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 pid=26358
2020-07-07T10:58:38.411-0500 [DEBUG] plugin: plugin exited
2020/07/07 10:58:38 [INFO] terraform: building graph: GraphTypeValidate
2020/07/07 10:58:38 [DEBUG] ProviderTransformer: "ibm_compute_vm_instance.my_server_2" (*terraform.NodeValidatableResource) needs provider.ibm
2020/07/07 10:58:38 [DEBUG] ProviderTransformer: "data.ibm_compute_bare_metal.bare_metal" (*terraform.NodeValidatableResource) needs provider.ibm
2020/07/07 10:58:38 [DEBUG] ProviderTransformer: "ibm_compute_bare_metal.test-terraform" (*terraform.NodeValidatableResource) needs provider.ibm
2020/07/07 10:58:38 [DEBUG] ReferenceTransformer: "ibm_compute_bare_metal.test-terraform" references: []
2020/07/07 10:58:38 [DEBUG] ReferenceTransformer: "ibm_compute_vm_instance.my_server_2" references: []
2020/07/07 10:58:38 [DEBUG] ReferenceTransformer: "data.ibm_compute_bare_metal.bare_metal" references: []
2020/07/07 10:58:38 [DEBUG] ReferenceTransformer: "output.so" references: [data.ibm_compute_bare_metal.bare_metal]
2020/07/07 10:58:38 [DEBUG] ReferenceTransformer: "output.id" references: [data.ibm_compute_bare_metal.bare_metal]
2020/07/07 10:58:38 [DEBUG] ReferenceTransformer: "var.ibmcloud_api_key" references: []
2020/07/07 10:58:38 [DEBUG] ReferenceTransformer: "provider.ibm" references: [var.ibmcloud_api_key]
2020/07/07 10:58:38 [DEBUG] Starting graph walk: walkValidate
2020-07-07T10:58:38.414-0500 [INFO]  plugin: configuring client automatic mTLS
2020-07-07T10:58:38.446-0500 [DEBUG] plugin: starting plugin: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 args=[/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1]
2020-07-07T10:58:38.447-0500 [DEBUG] plugin: plugin started: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 pid=26372
2020-07-07T10:58:38.447-0500 [DEBUG] plugin: waiting for RPC address: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1
2020-07-07T10:58:38.490-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:38 IBM Cloud Provider version 1.7.1
2020-07-07T10:58:38.492-0500 [INFO]  plugin.terraform-provider-ibm_v1.7.1: configuring server automatic mTLS: timestamp=2020-07-07T10:58:38.492-0500
2020-07-07T10:58:38.527-0500 [DEBUG] plugin: using plugin: version=5
2020-07-07T10:58:38.527-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: plugin address: address=/tmp/plugin899572435 network=unix timestamp=2020-07-07T10:58:38.527-0500
2020-07-07T10:58:38.603-0500 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unimplemented desc = unknown service plugin.GRPCStdio"
2020-07-07T10:58:38.650-0500 [DEBUG] plugin: plugin process exited: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 pid=26372
2020-07-07T10:58:38.650-0500 [DEBUG] plugin: plugin exited
2020/07/07 10:58:38 [INFO] backend/local: apply calling Refresh
2020/07/07 10:58:38 [INFO] terraform: building graph: GraphTypeRefresh
2020/07/07 10:58:38 [DEBUG] ProviderTransformer: "ibm_compute_bare_metal.test-terraform" (*terraform.NodeRefreshableManagedResource) needs provider.ibm
2020/07/07 10:58:38 [DEBUG] ProviderTransformer: "ibm_compute_vm_instance.my_server_2" (*terraform.NodeRefreshableManagedResource) needs provider.ibm
2020/07/07 10:58:38 [DEBUG] ProviderTransformer: "data.ibm_compute_bare_metal.bare_metal" (*terraform.NodeRefreshableDataResource) needs provider.ibm
2020/07/07 10:58:38 [DEBUG] ReferenceTransformer: "output.so" references: [data.ibm_compute_bare_metal.bare_metal]
2020/07/07 10:58:38 [DEBUG] ReferenceTransformer: "output.id" references: [data.ibm_compute_bare_metal.bare_metal]
2020/07/07 10:58:38 [DEBUG] ReferenceTransformer: "provider.ibm" references: [var.ibmcloud_api_key]
2020/07/07 10:58:38 [DEBUG] ReferenceTransformer: "ibm_compute_bare_metal.test-terraform" references: []
2020/07/07 10:58:38 [DEBUG] ReferenceTransformer: "ibm_compute_vm_instance.my_server_2" references: []
2020/07/07 10:58:38 [DEBUG] ReferenceTransformer: "data.ibm_compute_bare_metal.bare_metal" references: []
2020/07/07 10:58:38 [DEBUG] ReferenceTransformer: "var.ibmcloud_api_key" references: []
2020/07/07 10:58:38 [DEBUG] Starting graph walk: walkRefresh
2020-07-07T10:58:38.652-0500 [INFO]  plugin: configuring client automatic mTLS
2020-07-07T10:58:38.690-0500 [DEBUG] plugin: starting plugin: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 args=[/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1]
2020-07-07T10:58:38.691-0500 [DEBUG] plugin: plugin started: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 pid=26393
2020-07-07T10:58:38.691-0500 [DEBUG] plugin: waiting for RPC address: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1
2020-07-07T10:58:38.735-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:38 IBM Cloud Provider version 1.7.1
2020-07-07T10:58:38.737-0500 [INFO]  plugin.terraform-provider-ibm_v1.7.1: configuring server automatic mTLS: timestamp=2020-07-07T10:58:38.736-0500
2020-07-07T10:58:38.769-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: plugin address: address=/tmp/plugin704201705 network=unix timestamp=2020-07-07T10:58:38.768-0500
2020-07-07T10:58:38.769-0500 [DEBUG] plugin: using plugin: version=5
2020-07-07T10:58:38.861-0500 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unimplemented desc = unknown service plugin.GRPCStdio"
2020-07-07T10:58:38.887-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:38 Configuring SoftLayer Session with API key
2020-07-07T10:58:38.887-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:38 Configuring IBM Cloud Session with API key
2020-07-07T10:58:48.295-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:48 the apiendpoint url for power is eu-de.power-iaas.cloud.ibm.com
2020/07/07 10:58:48 [DEBUG] Resource state not found for node "ibm_compute_bare_metal.test-terraform", instance ibm_compute_bare_metal.test-terraform
2020/07/07 10:58:48 [DEBUG] ReferenceTransformer: "ibm_compute_bare_metal.test-terraform" references: []
2020/07/07 10:58:48 [DEBUG] ReferenceTransformer: "ibm_compute_vm_instance.my_server_2" references: []
2020/07/07 10:58:48 [DEBUG] ReferenceTransformer: "data.ibm_compute_bare_metal.bare_metal" references: []
ibm_compute_vm_instance.my_server_2: Refreshing state... [id=105323636]
2020-07-07T10:58:48.308-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:48 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/105323636.json
2020-07-07T10:58:48.308-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:48 [DEBUG] Parameters:
data.ibm_compute_bare_metal.bare_metal: Refreshing state...
2020-07-07T10:58:48.309-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:48 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Account/getHardware.json?objectFilter=%7B%22hardware%22%3A%7B%22domain%22%3A%7B%22operation%22%3A%22sopra.cloud%22%7D%2C%22hostname%22%3A%7B%22operation%22%3A%22poc3%22%7D%7D%7D&objectMask=mask%5BglobalIdentifier%2Chostname%2Cdomain%2CbandwidthAllocation%2CprovisionDate%2Cid%2CprimaryIpAddress%2CprimaryBackendIpAddress%2CprivateNetworkOnlyFlag%2Cnotes%2CuserData%5Bvalue%5D%2CtagReferences%5Bid%2Ctag%5Bname%5D%5D%2CallowedNetworkStorage%5Bid%2CnasType%5D%2ChourlyBillingFlag%2Cdatacenter%5Bid%2Cname%2ClongName%5D%2CprimaryNetworkComponent%5BprimarySubnet%5BnetworkVlan%5Bid%2CprimaryRouter%2CvlanNumber%5D%2Cid%5D%2CmaxSpeed%2CprimaryIpAddressRecord%5Bid%5D%2CprimaryVersion6IpAddressRecord%5Bsubnet%2Cid%5D%5D%2CprimaryBackendNetworkComponent%5BprimarySubnet%5BnetworkVlan%5Bid%2CprimaryRouter%2CvlanNumber%5D%2Cid%5D%2CprimaryIpAddressRecord%5Bid%5D%2CmaxSpeed%2CredundancyEnabledFlag%5D%2CmemoryCapacity%2CpowerSupplyCount%2CoperatingSystem%5BsoftwareLicense%5BsoftwareDescription%5BreferenceCode%5D%5D%5D%5D
2020-07-07T10:58:48.309-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:48 [DEBUG] Parameters:
2020/07/07 10:58:48 [WARN] Provider "registry.terraform.io/-/ibm" produced an invalid plan for ibm_compute_bare_metal.test-terraform, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .extended_hardware_testing: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .tcp_monitoring: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .software_guard_extensions: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .ipv6_static_enabled: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .restricted_network: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2020-07-07T10:58:48.868-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:48 [DEBUG] Status Code:  200
2020-07-07T10:58:48.868-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:48 [DEBUG] Response:  {"accountId":1430953,"createDate":"2020-07-07T07:04:07-06:00","dedicatedAccountHostOnlyFlag":false,"domain":"sopra.cloud","fullyQualifiedDomainName":"createdwithterraform.sopra.cloud","hostname":"createdwithterraform","id":105323636,"lastPowerStateId":null,"lastVerifiedDate":null,"maxCpu":1,"maxCpuUnits":"CORE","maxMemory":1024,"metricPollDate":null,"modifyDate":"2020-07-07T07:06:40-06:00","placementGroupId":null,"provisionDate":"2020-07-07T07:06:40-06:00","startCpus":1,"statusId":1001,"typeId":1,"uuid":"97682e2f-3bca-0afb-4655-6d00d1d848d5","globalIdentifier":"f01063ec-9290-4701-84c6-dbf0d375c11c","managedResourceFlag":false,"primaryBackendIpAddress":"10.136.238.39","primaryIpAddress":"159.8.245.187","status":{"keyName":"ACTIVE","name":"Active"}}
2020-07-07T10:58:48.897-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:48 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest/105323636.json?objectMask=mask%5Bhostname%2Cdomain%2CblockDevices%5BdiskImage%5D%2CstartCpus%2CmaxMemory%2CdedicatedAccountHostOnlyFlag%2CoperatingSystemReferenceCode%2CblockDeviceTemplateGroup%5Bid%5D%2CtransientGuestFlag%2CbillingItem%5BorderItem%5Bpreset%5BkeyName%5D%5D%5D%2CprimaryIpAddress%2CprimaryBackendIpAddress%2CprivateNetworkOnlyFlag%2ChourlyBillingFlag%2ClocalDiskFlag%2CallowedNetworkStorage%5Bid%2CnasType%5D%2Cnotes%2CuserData%5Bvalue%5D%2CtagReferences%5Bid%2Ctag%5Bname%5D%5D%2Cdatacenter%5Bid%2Cname%2ClongName%5D%2CsshKeys%2Cstatus%5BkeyName%2Cname%5D%2CprimaryNetworkComponent%5BnetworkVlan%5Bid%5D%2Csubnets%2CprimaryVersion6IpAddressRecord%5Bsubnet%2CguestNetworkComponentBinding%5BipAddressId%5D%5D%2CprimaryIpAddressRecord%5Bsubnet%2CguestNetworkComponentBinding%5BipAddressId%5D%5D%2CsecurityGroupBindings%5BsecurityGroup%5D%5D%2CprimaryBackendNetworkComponent%5BnetworkVlan%5Bid%5D%2CprimaryIpAddressRecord%5Bsubnet%2CguestNetworkComponentBinding%5BipAddressId%5D%5D%2CsecurityGroupBindings%5BsecurityGroup%5D%5D%2CevaultNetworkStorage%5BcapacityGb%5D%5D
2020-07-07T10:58:48.897-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:48 [DEBUG] Parameters:
2020-07-07T10:58:48.973-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:48 [DEBUG] Status Code:  200
ddress":"159.8.198.254"}}}},"privateNetworkOnlyFlag":false,"tagReferences":[{"id":173591492,"tag":{"name":"spain-poc-sap"}}],"userData":[]}]
2020-07-07T10:58:48.974-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:48 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Hardware/1582709/getBackendNetworkComponents.json?objectFilter=%7B%22backendNetworkComponents%22%3A%7B%22status%22%3A%7B%22operation%22%3A%22ACTIVE%22%7D%7D%7D
2020-07-07T10:58:48.974-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:48 [DEBUG] Parameters:
2020-07-07T10:58:49.506-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:49 [DEBUG] Status Code:  200
"fullyQualifiedDomainName":"poc3.sopra.cloud","hardwareStatusId":5,"hostname":"poc3","id":1582709,"manufacturerSerialNumber":"S40X79B","notes":"","provisionDate":"2020-06-30T03:25:31-06:00","serialNumber":"SL01D8DQ","serviceProviderId":1,"serviceProviderResourceId":1582709,"hardwareFunction":{"code":"WEBSVR","description":"Web Server","id":3},"hardwareStatus":{"id":5,"status":"ACTIVE"},"managedResourceFlag":false}}]
2020-07-07T10:58:49.507-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:49 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Account/getPublicSubnets.json?objectFilter=%7B%22publicSubnets%22%3A%7B%22endPointIpAddress%22%3A%7B%22ipAddress%22%3A%7B%22operation%22%3A%22159.8.245.184%22%7D%7D%7D%7D&objectMask=mask%5BipAddresses%5Bid%2CipAddress%5D%2CsubnetType%5D
2020-07-07T10:58:49.507-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:49 [DEBUG] Parameters:
2020-07-07T10:58:49.644-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:49 [DEBUG] Status Code:  200
":"10.136.238.63","cidr":26,"gateway":"10.136.238.1","id":1150909,"isCustomerOwned":false,"isCustomerRoutable":false,"modifyDate":"2020-06-29T07:45:32-06:00","netmask":"255.255.255.192","networkIdentifier":"10.136.238.0","networkVlanId":2901828,"sortOrder":"1","subnetType":"ADDITIONAL_PRIMARY","totalIpAddresses":"64","usableIpAddressCount":"61","version":4,"addressSpace":"PRIVATE"}},"securityGroupBindings":[]},"primaryIpAddress":"159.8.245.187","primaryNetworkComponent":{"createDate":"2020-07-07T07:04:17-06:00","guestId":105323636,"id":71358422,"macAddress":"06:65:c4:c9:ae:41","maxSpeed":10,"modifyDate":"2020-07-07T07:04:41-06:00","name":"eth","networkId":43007152,"port":1,"speed":10,"status":"ACTIVE","uuid":"ac861e1a-d8e5-02ff-af9d-cf866597d15f","guest":null,"ipAddressBindings":[{"ipAddressId":155449356}],"networkVlan":{"id":2902470},"primaryIpAddress":"159.8.245.187","primaryIpAddressRecord":{"id":155449356,"ipAddress":"159.8.245.187","isBroadcast":false,"isGateway":false,"isNetwork":false,"isReserved":false,"subnetId":1064089,"guestNetworkComponentBinding":{"ipAddressId":155449356},"subnet":{"broadcastAddress":"159.8.245.191","cidr":28,"gateway":"159.8.245.177","id":1064089,"isCustomerOwned":false,"isCustomerRoutable":false,"modifyDate":"2020-06-30T01:44:31-06:00","netmask":"255.255.255.240","networkIdentifier":"159.8.245.176","networkVlanId":2902470,"sortOrder":"1","subnetType":"ADDITIONAL_PRIMARY","totalIpAddresses":"16","usableIpAddressCount":"13","version":4,"addressSpace":"PUBLIC"}},"securityGroupBindings":[],"subnets":[]},"privateNetworkOnlyFlag":false,"sshKeys":[],"status":{"keyName":"ACTIVE","name":"Active"},"tagReferences":[],"transientGuestFlag":false,"userData":[]}
2020-07-07T10:58:49.645-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:49 [DEBUG] Request URL:  GET https://api.softlayer.com/rest/v3/SoftLayer_Account/getPublicSubnets.json?objectFilter=%7B%22publicSubnets%22%3A%7B%22endPointIpAddress%22%3A%7B%22ipAddress%22%3A%7B%22operation%22%3A%22159.8.245.187%22%7D%7D%7D%7D&objectMask=mask%5BipAddresses%5Bid%2CipAddress%5D%2CsubnetType%5D
2020-07-07T10:58:49.645-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:49 [DEBUG] Parameters:
2020-07-07T10:58:50.054-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:50 [DEBUG] Status Code:  200
2020-07-07T10:58:50.054-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:50 [DEBUG] Response:  []
2020-07-07T10:58:50.192-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:50 [DEBUG] Status Code:  200
2020-07-07T10:58:50.192-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:50 [DEBUG] Response:  []
2020-07-07T10:58:50.197-0500 [DEBUG] plugin: plugin process exited: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 pid=26393
2020-07-07T10:58:50.197-0500 [DEBUG] plugin: plugin exited
2020/07/07 10:58:50 [INFO] backend/local: apply calling Plan
2020/07/07 10:58:50 [INFO] terraform: building graph: GraphTypePlan
2020/07/07 10:58:50 [DEBUG] ProviderTransformer: "ibm_compute_vm_instance.my_server_2" (*terraform.NodePlannableResource) needs provider.ibm
2020/07/07 10:58:50 [DEBUG] ProviderTransformer: "ibm_compute_bare_metal.test-terraform" (*terraform.NodePlannableResource) needs provider.ibm
2020/07/07 10:58:50 [DEBUG] ProviderTransformer: "data.ibm_compute_bare_metal.bare_metal" (*terraform.NodePlannableResource) needs provider.ibm
2020/07/07 10:58:50 [DEBUG] ReferenceTransformer: "data.ibm_compute_bare_metal.bare_metal" references: []
2020/07/07 10:58:50 [DEBUG] ReferenceTransformer: "output.so" references: [data.ibm_compute_bare_metal.bare_metal]
2020/07/07 10:58:50 [DEBUG] ReferenceTransformer: "output.id" references: [data.ibm_compute_bare_metal.bare_metal]
2020/07/07 10:58:50 [DEBUG] ReferenceTransformer: "var.ibmcloud_api_key" references: []
2020/07/07 10:58:50 [DEBUG] ReferenceTransformer: "provider.ibm" references: [var.ibmcloud_api_key]
2020/07/07 10:58:50 [DEBUG] ReferenceTransformer: "ibm_compute_vm_instance.my_server_2" references: []
2020/07/07 10:58:50 [DEBUG] ReferenceTransformer: "ibm_compute_bare_metal.test-terraform" references: []
2020/07/07 10:58:50 [DEBUG] Starting graph walk: walkPlan
2020-07-07T10:58:50.200-0500 [INFO]  plugin: configuring client automatic mTLS
2020-07-07T10:58:50.240-0500 [DEBUG] plugin: starting plugin: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 args=[/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1]
2020-07-07T10:58:50.241-0500 [DEBUG] plugin: plugin started: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 pid=26493
2020-07-07T10:58:50.241-0500 [DEBUG] plugin: waiting for RPC address: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1
2020-07-07T10:58:50.308-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:50 IBM Cloud Provider version 1.7.1
2020-07-07T10:58:50.311-0500 [INFO]  plugin.terraform-provider-ibm_v1.7.1: configuring server automatic mTLS: timestamp=2020-07-07T10:58:50.311-0500
2020-07-07T10:58:50.348-0500 [DEBUG] plugin: using plugin: version=5
2020-07-07T10:58:50.348-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: plugin address: address=/tmp/plugin274163443 network=unix timestamp=2020-07-07T10:58:50.348-0500
2020-07-07T10:58:50.422-0500 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unimplemented desc = unknown service plugin.GRPCStdio"
2020-07-07T10:58:50.447-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:50 Configuring SoftLayer Session with API key
2020-07-07T10:58:50.447-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:50 Configuring IBM Cloud Session with API key
2020-07-07T10:58:55.588-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:55 the apiendpoint url for power is eu-de.power-iaas.cloud.ibm.com
2020/07/07 10:58:55 [DEBUG] ReferenceTransformer: "data.ibm_compute_bare_metal.bare_metal" references: []
2020/07/07 10:58:55 [DEBUG] ReferenceTransformer: "ibm_compute_vm_instance.my_server_2" references: []
2020/07/07 10:58:55 [DEBUG] Resource instance state not found for node "ibm_compute_bare_metal.test-terraform", instance ibm_compute_bare_metal.test-terraform
2020/07/07 10:58:55 [DEBUG] ReferenceTransformer: "ibm_compute_bare_metal.test-terraform" references: []
2020/07/07 10:58:55 [WARN] Provider "registry.terraform.io/-/ibm" produced an invalid plan for ibm_compute_bare_metal.test-terraform, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .software_guard_extensions: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .ipv6_static_enabled: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .restricted_network: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .tcp_monitoring: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .extended_hardware_testing: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2020-07-07T10:58:55.605-0500 [DEBUG] plugin: plugin process exited: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 pid=26493
2020-07-07T10:58:55.605-0500 [DEBUG] plugin: plugin exited

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

2020/07/07 10:58:55 [DEBUG] command: asking for input: "Do you want to perform these actions?"
  # ibm_compute_bare_metal.test-terraform will be created
  + resource "ibm_compute_bare_metal" "test-terraform" {
      + block_storage_ids         = (known after apply)
      + datacenter                = "ams03"
      + domain                    = "sopra.cloud"
      + extended_hardware_testing = false
      + file_storage_ids          = (known after apply)
      + fixed_config_preset       = "1U_6248S_384GB_1X3_8_SED_JBOD"
      + global_identifier         = (known after apply)
      + hostname                  = "createwithterraform"
      + hourly_billing            = true
      + id                        = (known after apply)
      + ipv6_address              = (known after apply)
      + ipv6_address_id           = (known after apply)
      + ipv6_enabled              = false
      + ipv6_static_enabled       = false
      + memory                    = 32
      + network_speed             = 100
      + os_reference_code         = "REDHAT_7_64"
      + private_ipv4_address      = (known after apply)
      + private_ipv4_address_id   = (known after apply)
      + private_network_only      = false
      + private_subnet            = (known after apply)
      + private_vlan_id           = (known after apply)
      + public_bandwidth          = 0
      + public_ipv4_address       = (known after apply)
      + public_ipv4_address_id    = (known after apply)
      + public_subnet             = (known after apply)
      + public_vlan_id            = (known after apply)
      + redundant_network         = true
      + redundant_power_supply    = true
      + restricted_network        = false
      + secondary_ip_addresses    = (known after apply)
      + software_guard_extensions = false
      + tcp_monitoring            = false
      + unbonded_network          = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

2020/07/07 10:58:57 [INFO] backend/local: apply calling Apply
2020/07/07 10:58:57 [INFO] terraform: building graph: GraphTypeApply
2020/07/07 10:58:57 [DEBUG] Resource state not found for node "ibm_compute_bare_metal.test-terraform", instance ibm_compute_bare_metal.test-terraform
2020/07/07 10:58:57 [DEBUG] ProviderTransformer: "ibm_compute_vm_instance.my_server_2 (prepare state)" (*terraform.NodeApplyableResource) needs provider.ibm
2020/07/07 10:58:57 [DEBUG] ProviderTransformer: "data.ibm_compute_bare_metal.bare_metal (prepare state)" (*terraform.NodeApplyableResource) needs provider.ibm
2020/07/07 10:58:57 [DEBUG] ProviderTransformer: "ibm_compute_bare_metal.test-terraform" (*terraform.NodeApplyableResourceInstance) needs provider.ibm
2020/07/07 10:58:57 [DEBUG] ProviderTransformer: "ibm_compute_bare_metal.test-terraform (prepare state)" (*terraform.NodeApplyableResource) needs provider.ibm
2020/07/07 10:58:57 [DEBUG] ReferenceTransformer: "output.so" references: [data.ibm_compute_bare_metal.bare_metal (prepare state)]
2020/07/07 10:58:57 [DEBUG] ReferenceTransformer: "output.id" references: [data.ibm_compute_bare_metal.bare_metal (prepare state)]
2020/07/07 10:58:57 [DEBUG] ReferenceTransformer: "provider.ibm" references: [var.ibmcloud_api_key]
2020/07/07 10:58:57 [DEBUG] ReferenceTransformer: "ibm_compute_bare_metal.test-terraform (prepare state)" references: []
2020/07/07 10:58:57 [DEBUG] ReferenceTransformer: "ibm_compute_vm_instance.my_server_2 (prepare state)" references: []
2020/07/07 10:58:57 [DEBUG] ReferenceTransformer: "data.ibm_compute_bare_metal.bare_metal (prepare state)" references: []
2020/07/07 10:58:57 [DEBUG] ReferenceTransformer: "ibm_compute_bare_metal.test-terraform" references: []
2020/07/07 10:58:57 [DEBUG] ReferenceTransformer: "var.ibmcloud_api_key" references: []
2020-07-07T10:58:57.333-0500 [INFO]  plugin: configuring client automatic mTLS
2020-07-07T10:58:57.378-0500 [DEBUG] plugin: starting plugin: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 args=[/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1]
2020-07-07T10:58:57.378-0500 [DEBUG] plugin: plugin started: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 pid=26547
2020-07-07T10:58:57.378-0500 [DEBUG] plugin: waiting for RPC address: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1
2020-07-07T10:58:57.426-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:57 IBM Cloud Provider version 1.7.1
2020-07-07T10:58:57.428-0500 [INFO]  plugin.terraform-provider-ibm_v1.7.1: configuring server automatic mTLS: timestamp=2020-07-07T10:58:57.428-0500
2020-07-07T10:58:57.461-0500 [DEBUG] plugin: using plugin: version=5
2020-07-07T10:58:57.461-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: plugin address: address=/tmp/plugin419073459 network=unix timestamp=2020-07-07T10:58:57.461-0500
2020-07-07T10:58:57.536-0500 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unimplemented desc = unknown service plugin.GRPCStdio"
2020-07-07T10:58:57.560-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:57 Configuring SoftLayer Session with API key
2020-07-07T10:58:57.560-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:58:57 Configuring IBM Cloud Session with API key
2020-07-07T10:59:00.184-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:59:00 the apiendpoint url for power is eu-de.power-iaas.cloud.ibm.com
2020/07/07 10:59:00 [WARN] Provider "registry.terraform.io/-/ibm" produced an invalid plan for ibm_compute_bare_metal.test-terraform, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .ipv6_static_enabled: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .restricted_network: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .tcp_monitoring: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .extended_hardware_testing: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .software_guard_extensions: planned value cty.False does not match config value cty.NullVal(cty.Bool)
ibm_compute_bare_metal.test-terraform: Creating...
2020/07/07 10:59:00 [DEBUG] ibm_compute_bare_metal.test-terraform: applying the planned Create change
2020-07-07T10:59:00.193-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:59:00 [DEBUG] setting computed for "secondary_ip_addresses" from ComputedKeys
2020-07-07T10:59:00.193-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:59:00 [DEBUG] setting computed for "file_storage_ids" from ComputedKeys
2020-07-07T10:59:00.193-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:59:00 [DEBUG] setting computed for "block_storage_ids" from ComputedKeys
2020-07-07T10:59:00.215-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:59:00 [DEBUG] Request URL:  POST https://api.softlayer.com/rest/v3/SoftLayer_Hardware/generateOrderTemplate.json
2020-07-07T10:59:00.215-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:59:00 [DEBUG] Parameters:  {"parameters":[{"bareMetalInstanceFlag":1,"datacenter":{"name":"ams03"},"domain":"sopra.cloud","fixedConfigurationPreset":{"keyName":"1U_6248S_384GB_1X3_8_SED_JBOD"},"hostname":"createwithterraform","hourlyBillingFlag":true,"networkComponents":[{"maxSpeed":100}],"operatingSystemReferenceCode":"REDHAT_7_64","postInstallScriptUri":"","privateNetworkOnlyFlag":false}]}
2020-07-07T10:59:01.351-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:59:01 [DEBUG] Status Code:  500
2020-07-07T10:59:01.351-0500 [DEBUG] plugin.terraform-provider-ibm_v1.7.1: 2020/07/07 10:59:01 [DEBUG] Response:  {"error":"Unable to match an OS with reference code: REDHAT_7_64","code":"SoftLayer_Exception_NotFound"}
2020/07/07 10:59:01 [DEBUG] ibm_compute_bare_metal.test-terraform: apply errored, but we're indicating that via the Error pointer rather than returning it: Encountered problem trying to get the bare metal order template: SoftLayer_Exception_NotFound: Unable to match an OS with reference code: REDHAT_7_64 (HTTP 500)
2020/07/07 10:59:01 [ERROR] <root>: eval: *terraform.EvalApplyPost, err: Encountered problem trying to get the bare metal order template: SoftLayer_Exception_NotFound: Unable to match an OS with reference code: REDHAT_7_64 (HTTP 500)
2020/07/07 10:59:01 [ERROR] <root>: eval: *terraform.EvalSequence, err: Encountered problem trying to get the bare metal order template: SoftLayer_Exception_NotFound: Unable to match an OS with reference code: REDHAT_7_64 (HTTP 500)

Error: Encountered problem trying to get the bare metal order template: SoftLayer_Exception_NotFound: Unable to match an OS with reference code: REDHAT_7_64 (HTTP 500)

  on main.tf line 1, in resource "ibm_compute_bare_metal" "test-terraform":
   1: resource "ibm_compute_bare_metal" "test-terraform" {


2020-07-07T10:59:01.360-0500 [DEBUG] plugin: plugin process exited: path=/opt/devops/terraform/IBM-SAP-POC/TERRAFORM/.terraform/plugins/linux_amd64/terraform-provider-ibm_v1.7.1 pid=26547
2020-07-07T10:59:01.360-0500 [DEBUG] plugin: plugin exited
 
